#+TITLE: Multiple Projects

=floco= was designed to make managing multiple local projects
easy, in fact it was originally designed to allow "recursive
local builds" in a way that =yarn= and =npm= really struggle
to provide.

The summary of this article for a =project-a= that depends on
=project-b= is basically:
#+BEGIN_SRC nix
{
  _file   = "project-a/floco-cfg.nix";
  imports = [
    ./pdefs.nix
    ./foverrides.nix
    ../project-b/floco-cfg.nix
  ];
}
#+END_SRC

*** Merging Attrsets

The merge routines for =attrsOf= and =lazyAttrsOf=
use the =//= operator to join definitons, and the way that
it treats =priority= for the attrsets and its members is
worth exploring.

We won't get into the differences between =lazyAttrsOf= and
=attrsOf= ( covered in NixOS manual ), except to say that we
prefer =lazyAttrsOf= and that you should avoid =lib.mkIf=
with =floco= because of how commonly we use it.

To keep things brief we'll use the following example to
show the merge behaviors with different priority settings.

#+BEGIN_SRC nix
let
  inherit (builtins.getFlake "floco") lib;
  interface = { lib, ... }: {
    options.bar = lib.mkOption {
      type = lib.types.lazyAttrsOf lib.types.anything;
    };
    options.foo = lib.mkOption {
      type = lib.types.lazyAttrsOf lib.types.anything;
    };
    options.quux = lib.mkOption {
      type = lib.types.lazyAttrsOf lib.types.anything;
    };
  };

  c0 = {
    config.bar = {
      a = 0;
      b = lib.mkForce 1;
    };

    config.foo.a = 0;
    config.foo.b = lib.mkForce 1;

    config.quux = lib.mkDefault {
      a = 0;
      b = lib.mkForce 1;
    };
  };

  c1 = {
    config.bar = lib.mkForce {
      b = 2;
      c = 3;
    };

    config.foo.b = lib.mkDefault 2;
    config.foo.c = 3;

    config.quux = lib.mkDefault {
      b = 2;
      c = 3;
    };
  };

  mod = lib.evalModules { modules = [interface c0 c1]; };

in lib.generators.toPretty {} mod.config
#+END_SRC

#+RESULTS:
#+begin_example
{
  bar = {
    b = 2;
    c = 3;
  };
  foo = {
    a = 0;
    b = 1;
    c = 3;
  };
  quux = {
    a = 0;
    b = 1;
    c = 3;
  };
}
#+end_example

So things to pay attention to here:
- You can set priority on the outer attrset, or individual values.
- Priority of the attrset are processed "first", then priority is
  processed for individual fields.
  + See =quux.b= vs =bar.b=.
  + Consider how =builtins.mapAttrs= might be used in this context.
